{
  "header": "Rule Set",
  "rules": [
    { "clause": "Match Format clause", "rule": "Matches are to be played in the NatDex AG (anything goes) format on Pokemon Showdown." },
    { "clause": "Match Notice clause", "rule": "You will be notified of your weekly opponent a minimum of 5 days before the deadline matches are to be completed and uploaded to the #pokemon-league channel in the Discord prior to the weekly deadline (Every Monday following the week you were scheduled to play). You may also have your matches played and casted live on stream. Just notify Skrelp in chat and post a link to the Showdown match. Any player that does not complete their weekly match and does not have any proof of attempting to contact their opponent at least 2 days before the deadline will receive an automatic loss." },
    { "clause": "Item clause", "rule": "Item Clause is active. You may only have one of any specific item on your team at the same time. Having 2 of any item (like Leftovers on your Corviknight AND Swampert in the same fight) will result in automatic forfeit for that match." },
    { "clause": "Moveset clause", "rule": "The attack 'Baton Pass' is banned." },
    { "clause": "Dynamax clause", "rule": "Dynamax and Gigantamax are banned. Upon Dynamaxing, a player automatically forfeits their match." },
    { "clause": "Mega Evolution clause", "rule": "While every player receives 1 Mega Evolution enabled Pokemon, they are not required to Mega Evolve during the match should they choose to bring that Pokemon." },
    { "clause": "Team Generation clause", "rule": "Every team is randomly determined before the beginning of the season and the randomization will all be live streamed on Twitch.tv/HelptheSkrelp." },
    { "clause": "Pokemon Reroll clause", "rule": "At the end of every week, each player has the right to reroll 1 Pokemon from the type of their choosing. The conditions for rerolling a Pokemon is that the player must have brought the Pokemon they have selected to reroll during the week they wish to reroll it or they must have KO’d an opponent’s Pokemon with the Pokemon they wish to reroll at some point during the season." },
    { "clause": "Mega Transfer clause", "rule": "The permission for a Pokemon to Mega Evolve may also be transferred from your Mega that is determined pre-season to a different member of your team. The conditions for transferring Mega permission is that your original Mega must secure 5 KOs. For example, if you knock out 2 Pokemon with your Mega Altaria in week 1 and 3 Pokemon in Week 2, prior to Week 3 you may transfer Altaria’s permission to Mega Evolve to your Mawile. However, this means that Altaria can no longer Mega evolve, while Mawile can." },
    { "clause": "Sign up clause", "rule": "There will be a Prize Pool. No, I don’t know what it is yet. There will be a 5$ entry fee for all participants. 100% of the money from the entry fee will be going towards the prize pool as well as some of my own money. The fee is mostly to discourage people from signing up who aren’t actually interested enough to stay with us for the whole season. There will also be a raffle prize so everyone in the league has a chance to win regardless of their standing at the end of the season!" },
    { "clause": "Drop Out clause", "rule": "Any players who participated in Season 0 and dropped out without good reason or without finding a replacement will not be permitted to participate in Season 1 (“too busy” is not a good reason, if you are too busy then do not register for the week). If you wish to drop out of the league, you must contact me with your reasoning and find a replacement (I will do my best to help with this). Failure to comply with this rule (or a piss poor excuse like not having time) will result in a permanent ban from all future iterations of this competition and is subject to a temporary or permanent ban from the community depending on the circumstances. It takes no longer than 30 mins to build a team and do your weekly battle. Don’t pretend you don’t have time if you sign up and don’t bail and leave me to clean up the mess." },
    { "clause": "Fun clause", "rule": "Have fun ya jackasses! IThis is a super unique and fun ruleset with the intention of lowering the bar for entry to players that enjoy or are just getting into competitive battling and want to try a draft format. The point is to have fun and not take it too seriously. Drafting is hard, let RNG pick your team :)." }
  ]
}